modm-ext/data.modm.io/docs/svd/header_stm32h7a3xx.svd
        <register>
          <name>LUT167H</name>
          <description>GFXMMU LUT registers</description>
          <addressOffset>0x153c</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>LO</name>
              <description>LO[21:4] bits (Line offset)</description>
              <bitOffset>4</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT168L</name>
          <description>GFXMMU LUT registers</description>
          <addressOffset>0x1540</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>EN</name>
              <description>Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FVB</name>
              <description>FVB[7:0] bits (First visible block)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>LVB</name>
              <description>LVB[7:0] bits (Last visible block)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT168H</name>
          <description>GFXMMU LUT registers</description>
          <addressOffset>0x1544</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>LO</name>
              <description>LO[21:4] bits (Line offset)</description>
              <bitOffset>4</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT169L</name>
          <description>GFXMMU LUT registers</description>
          <addressOffset>0x1548</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>EN</name>
              <description>Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FVB</name>
              <description>FVB[7:0] bits (First visible block)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>LVB</name>
              <description>LVB[7:0] bits (Last visible block)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT169H</name>
          <description>GFXMMU LUT registers</description>
          <addressOffset>0x154c</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>LO</name>
              <description>LO[21:4] bits (Line offset)</description>
              <bitOffset>4</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT170L</name>
          <description>GFXMMU LUT registers</description>
          <addressOffset>0x1550</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>EN</name>
              <description>Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FVB</name>
              <description>FVB[7:0] bits (First visible block)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>LVB</name>
              <description>LVB[7:0] bits (Last visible block)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT170H</name>
          <description>GFXMMU LUT registers</description>
          <addressOffset>0x1554</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>LO</name>
              <description>LO[21:4] bits (Line offset)</description>
              <bitOffset>4</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT171L</name>
          <description>GFXMMU LUT registers</description>
          <addressOffset>0x1558</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>EN</name>
              <description>Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FVB</name>
              <description>FVB[7:0] bits (First visible block)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>LVB</name>
              <description>LVB[7:0] bits (Last visible block)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT171H</name>
          <description>GFXMMU LUT registers</description>
          <addressOffset>0x155c</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>LO</name>
              <description>LO[21:4] bits (Line offset)</description>
              <bitOffset>4</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT172L</name>
          <description>GFXMMU LUT registers</description>
          <addressOffset>0x1560</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>EN</name>
              <description>Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FVB</name>
              <description>FVB[7:0] bits (First visible block)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>LVB</name>
              <description>LVB[7:0] bits (Last visible block)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT172H</name>
          <description>GFXMMU LUT registers</description>
          <addressOffset>0x1564</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>LO</name>
              <description>LO[21:4] bits (Line offset)</description>
              <bitOffset>4</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT173L</name>
          <description>GFXMMU LUT registers</description>
          <addressOffset>0x1568</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>EN</name>
              <description>Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FVB</name>
              <description>FVB[7:0] bits (First visible block)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>LVB</name>
              <description>LVB[7:0] bits (Last visible block)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT173H</name>
          <description>GFXMMU LUT registers</description>
          <addressOffset>0x156c</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>LO</name>
              <description>LO[21:4] bits (Line offset)</description>
              <bitOffset>4</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT174L</name>
          <description>GFXMMU LUT registers</description>
          <addressOffset>0x1570</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>EN</name>
              <description>Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FVB</name>
              <description>FVB[7:0] bits (First visible block)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>LVB</name>
              <description>LVB[7:0] bits (Last visible block)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT174H</name>
          <description>GFXMMU LUT registers</description>
          <addressOffset>0x1574</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>LO</name>
              <description>LO[21:4] bits (Line offset)</description>
              <bitOffset>4</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT175L</name>
          <description>GFXMMU LUT registers</description>
          <addressOffset>0x1578</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>EN</name>
              <description>Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FVB</name>
              <description>FVB[7:0] bits (First visible block)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>LVB</name>
              <description>LVB[7:0] bits (Last visible block)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT175H</name>
          <description>GFXMMU LUT registers</description>
          <addressOffset>0x157c</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>LO</name>
              <description>LO[21:4] bits (Line offset)</description>
              <bitOffset>4</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT176L</name>
          <description>GFXMMU LUT registers</description>
          <addressOffset>0x1580</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>EN</name>
              <description>Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FVB</name>
              <description>FVB[7:0] bits (First visible block)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>LVB</name>
              <description>LVB[7:0] bits (Last visible block)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT176H</name>
          <description>GFXMMU LUT registers</description>
          <addressOffset>0x1584</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>LO</name>
              <description>LO[21:4] bits (Line offset)</description>
              <bitOffset>4</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT177L</name>
          <description>GFXMMU LUT registers</description>
          <addressOffset>0x1588</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>EN</name>
              <description>Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FVB</name>
              <description>FVB[7:0] bits (First visible block)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>LVB</name>
              <description>LVB[7:0] bits (Last visible block)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT177H</name>
          <description>GFXMMU LUT registers</description>
          <addressOffset>0x158c</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>LO</name>
              <description>LO[21:4] bits (Line offset)</description>
              <bitOffset>4</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT178L</name>
          <description>GFXMMU LUT registers</description>
          <addressOffset>0x1590</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>EN</name>
              <description>Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FVB</name>
              <description>FVB[7:0] bits (First visible block)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>LVB</name>
              <description>LVB[7:0] bits (Last visible block)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT178H</name>
          <description>GFXMMU LUT registers</description>
          <addressOffset>0x1594</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>LO</name>
              <description>LO[21:4] bits (Line offset)</description>
              <bitOffset>4</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT179L</name>
          <description>GFXMMU LUT registers</description>
          <addressOffset>0x1598</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>EN</name>
              <description>Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FVB</name>
              <description>FVB[7:0] bits (First visible block)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>LVB</name>
              <description>LVB[7:0] bits (Last visible block)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT179H</name>
          <description>GFXMMU LUT registers</description>
          <addressOffset>0x159c</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>LO</name>
              <description>LO[21:4] bits (Line offset)</description>
              <bitOffset>4</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT180L</name>
          <description>GFXMMU LUT registers</description>
          <addressOffset>0x15a0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>EN</name>
              <description>Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FVB</name>
              <description>FVB[7:0] bits (First visible block)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>LVB</name>
              <description>LVB[7:0] bits (Last visible block)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT180H</name>
          <description>GFXMMU LUT registers</description>
          <addressOffset>0x15a4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>LO</name>
              <description>LO[21:4] bits (Line offset)</description>
              <bitOffset>4</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT181L</name>
          <description>GFXMMU LUT registers</description>
          <addressOffset>0x15a8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>EN</name>
              <description>Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FVB</name>
              <description>FVB[7:0] bits (First visible block)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>LVB</name>
              <description>LVB[7:0] bits (Last visible block)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT181H</name>
          <description>GFXMMU LUT registers</description>
          <addressOffset>0x15ac</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>LO</name>
              <description>LO[21:4] bits (Line offset)</description>
              <bitOffset>4</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT182L</name>
          <description>GFXMMU LUT registers</description>
          <addressOffset>0x15b0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>EN</name>
              <description>Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FVB</name>
              <description>FVB[7:0] bits (First visible block)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>LVB</name>
              <description>LVB[7:0] bits (Last visible block)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT182H</name>
          <description>GFXMMU LUT registers</description>
          <addressOffset>0x15b4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>LO</name>
              <description>LO[21:4] bits (Line offset)</description>
              <bitOffset>4</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT183L</name>
          <description>GFXMMU LUT registers</description>
          <addressOffset>0x15b8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>EN</name>
              <description>Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FVB</name>
              <description>FVB[7:0] bits (First visible block)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>LVB</name>
              <description>LVB[7:0] bits (Last visible block)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT183H</name>
          <description>GFXMMU LUT registers</description>
          <addressOffset>0x15bc</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>LO</name>
              <description>LO[21:4] bits (Line offset)</description>
              <bitOffset>4</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT184L</name>
          <description>GFXMMU LUT registers</description>
          <addressOffset>0x15c0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>EN</name>
              <description>Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FVB</name>
              <description>FVB[7:0] bits (First visible block)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>LVB</name>
              <description>LVB[7:0] bits (Last visible block)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT184H</name>
          <description>GFXMMU LUT registers</description>
          <addressOffset>0x15c4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>LO</name>
              <description>LO[21:4] bits (Line offset)</description>
              <bitOffset>4</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
