modm-ext/data.modm.io/docs/svd/header_stm32h7a3xx.svd
        <register>
          <name>APB2LPENR</name>
          <description>RCC APB2 peripheral sleep clock register</description>
          <addressOffset>0x178</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>TIM1LPEN</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TIM8LPEN</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>USART1LPEN</name>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>USART6LPEN</name>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>UART9LPEN</name>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>USART10LPEN</name>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SPI1LPEN</name>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SPI4LPEN</name>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TIM15LPEN</name>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TIM16LPEN</name>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TIM17LPEN</name>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SPI5LPEN</name>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SAI1LPEN</name>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SAI2LPEN</name>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DFSDM1LPEN</name>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>APB4LPENR</name>
          <description>RCC APB4 peripheral sleep clock register</description>
          <addressOffset>0x17c</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SYSCFGLPEN</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LPUART1LPEN</name>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SPI6LPEN</name>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>I2C4LPEN</name>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LPTIM2LPEN</name>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LPTIM3LPEN</name>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DAC2LPEN</name>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>COMP12LPEN</name>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>VREFLPEN</name>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RTCAPBLPEN</name>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DTSLPEN</name>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DFSDM2LPEN</name>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>PWR</name>
      <description>Power Control</description>
      <baseAddress>0x58024800</baseAddress>
      <registers>
        <register>
          <name>CR1</name>
          <description>PWR power control register 1</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>LPDS</name>
              <description>Low Power Deepsleep with SVOS3</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MAIN</name>
                  <description>Voltage Regulator in main mode during deepsleep mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOW_POWER</name>
                  <description>Voltage Regulator in low-power mode during deepsleep mode</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PVDEN</name>
              <description>Programmable Voltage detector enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PLS</name>
              <description>Programmable Voltage Detector level selection</description>
              <bitOffset>5</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PVDLEVEL_0</name>
                  <description>Voltage threshold detected by PVD 1.95 V</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PVDLEVEL_1</name>
                  <description>Voltage threshold detected by PVD 2.1 V</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PVDLEVEL_2</name>
                  <description>Voltage threshold detected by PVD 2.25 V</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PVDLEVEL_3</name>
                  <description>Voltage threshold detected by PVD 2.4 V</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PVDLEVEL_4</name>
                  <description>Voltage threshold detected by PVD 2.55 V</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PVDLEVEL_5</name>
                  <description>Voltage threshold detected by PVD 2.7 V</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PVDLEVEL_6</name>
                  <description>Voltage threshold detected by PVD 2.85 V</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PVDLEVEL_7</name>
                  <description>External voltage level on PVD_IN pin, compared to internal VREFINT level.</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DBP</name>
              <description>Disable Back-up domain Protection</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLPS</name>
              <description>Flash low power mode in DSTOP</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BOOSTE</name>
              <description>Analog Switch VBoost control</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AVD_READY</name>
              <description>Analog Voltage Ready</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SVOS</name>
              <description>System STOP mode Voltage Scaling selection</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SCALE3</name>
                  <description>Select voltage scale 3 when system enters STOP mode</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SCALE4</name>
                  <description>Select voltage scale 4 when system enters STOP mode</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SCALE5</name>
                  <description>Select voltage scale 5 when system enters STOP mode</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AVDEN</name>
              <description>Analog Voltage Detector Enable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ALS</name>
              <description>Analog Voltage Detector level selection</description>
              <bitOffset>17</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AVDLEVEL_0</name>
                  <description>Analog Voltage threshold detected by AVD 1.7 V</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AVDLEVEL_1</name>
                  <description>Analog Voltage threshold detected by AVD 2.1 V</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AVDLEVEL_2</name>
                  <description>Analog Voltage threshold detected by AVD 2.5 V</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AVDLEVEL_3</name>
                  <description>Analog Voltage threshold detected by AVD 2.8 V</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AXIRAM1SO</name>
              <description>AXI RAM1 Shut-Off in DStop/DStop2 Mode</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AXIRAM2SO</name>
              <description>AXI RAM2 Shut-Off in DStop/DStop2 Mode</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AXIRAM3SO</name>
              <description>AXI RAM3 Shut-Off in DStop/DStop2 Mode</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AHBRAM1SO</name>
              <description>AHB RAM1 Shut-Off in DStop/DStop2 Mode</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AHBRAM2SO</name>
              <description>AHB RAM2 Shut-Off in DStop/DStop2 Mode</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ITCMSO</name>
              <description>Instruction TCM and ETM Memories Shut-Off in DStop/DStop2 Mode</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GFXSO</name>
              <description>GFXMMU and JPEG Memories Shut-Off in DStop/DStop2 Mode</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HSITFSO</name>
              <description>High-Speed Interfaces USB and FDCAN Memories Shut-off in DStop/DStop2 Mode</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SRDRAMSO</name>
              <description>SmartRun Domain AHB Memory Shut-Off in DStop/DStop2 Low-Power Mode</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CSR1</name>
          <description>PWR power control status register 1</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>PVDO</name>
              <description>Programmable Voltage Detect Output</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ACTVOSRDY</name>
              <description>Ready bit for current actual used VOS for VDD11 Voltage Scaling</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ACTVOS</name>
              <description>Current actual used VOS for VDD11 Voltage Scaling</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>AVDO</name>
              <description>Analog Voltage Detect Output</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MMCVDO</name>
              <description>voltage detector output on VDDMMC</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CR2</name>
          <description>PWR power control register 2</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>BREN</name>
              <description>Backup regulator enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MONEN</name>
              <description>VBAT and temperature monitoring enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BRRDY</name>
              <description>Backup regulator ready</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>VBATL</name>
              <description>Monitored VBAT level above low threshold</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>VBATH</name>
              <description>Monitored VBAT level above high threshold</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TEMPL</name>
              <description>Monitored temperature level above low threshold</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TEMPH</name>
              <description>Monitored temperature level above high threshold</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CR3</name>
          <description>PWR power control register 3</description>
          <addressOffset>0xc</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>BYPASS</name>
              <description>Power Management Unit bypass</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LDOEN</name>
              <description>Low Drop Output regulator enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SCUEN</name>
              <description>Supply configuration update enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>VBE</name>
              <description>VBAT charging enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>VBRS</name>
              <description>VBAT charging resistor selection</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CHARG_RESISTOR_5K</name>
                  <description>Charge the Battery through a 5 kO resistor</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHARGRESISTOR_1_5K</name>
                  <description>Charge the Battery through a 1.5 kO resistor</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>USB33DEN</name>
              <description>VDD33_USB voltage level detector enable</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>USBREGEN</name>
              <description>USB regulator enable</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>USB33RDY</name>
              <description>USB supply ready</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CPUCR</name>
          <description>PWR CPU control register</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>RETDS_CD</name>
              <description>CD domain Power Down Deepsleep selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CDSTOP</name>
                  <description>Enter CD domain to Stop mode when the CPU enters deepsleep</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CDSTOP2</name>
                  <description>Enter CD domain to Stop2 mode when the CPU enters deepsleep</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PDDS_SRD</name>
              <description>System SRD domain Power Down Deepsleep</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SRDSTOP</name>
                  <description>Enter SRD domain to Stop mode when the CPU enters deepsleep</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SRDSTANDBY</name>
                  <description>Enter SRD domain to Standby mode when the CPU enters deepsleep</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STOPF</name>
              <description>STOP Flag</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SBF</name>
              <description>System STANDBY Flag</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CSSF</name>
              <description>Clear D1 domain CPU1 STANDBY, STOP and HOLD flags</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RUN_SRD</name>
              <description>Keep system SRD domain in RUN mode regardless of the CPU sub-systems modes</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SRDCR</name>
          <description>PWR SRD domain control register</description>
          <addressOffset>0x18</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>VOSRDY</name>
              <description>VOS Ready bit for VDD11 Voltage Scaling output selection</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>VOS</name>
              <description>Voltage Scaling selection according performance</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
